Show / Hide Table of Contents
Class IDEAProgress
Progress Report for IOM
Inheritance
System.Object
IDEAProgress
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IDEAProgress
Constructors
Improve this Doc   View Source
IDEAProgress(Action<IDEAProgressReport>)
Constructor
Declaration
public IDEAProgress(Action<IDEAProgressReport> callback)
Parameters
 Type |  Name |  Description
 System.Action<IDEAProgressReport> |  callback
Callback function of progress
Methods
Improve this Doc   View Source
Report(IDEAProgressReport)
Report
Declaration
public void Report(IDEAProgressReport data)
Parameters
 Type |  Name |  Description
 IDEAProgressReport |  data
Data for progress report of IOM
 Improve this Doc
 View Source